cf_billing/Documents/энргИзменениеКоличестваПрописанныхПроживающихСобственников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргИзменениеКоличестваПрописанныхПроживающихСобственников</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргКоличествоПроживающих</xr:Item>
				<xr:Item>InformationRegister.энргКоличествоСобственников</xr:Item>
				<xr:Item>InformationRegister.энргКоличествоПрописанных</xr:Item>
				<xr:Item>InformationRegister.энргКоличествоЖильцов</xr:Item>
				<xr:Item>InformationRegister.энргЖильцыЛьготныхКатегорий</xr:Item>
				<xr:Item>InformationRegister.энргСобственникиПомещений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПроживающих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСобственников</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПрописанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолеваяСобственность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Жильцы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляСобственности</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СвидетельствоОРегистрацииНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>6</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СвидетельствоОРегистрацииДата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СвидетельствоОРегистрацииСерия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляСобственностиЧислитель</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляСобственностиЗнаменатель</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СвидетельствоОРегистрацииКемВыдан</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьЛьготнаяКатегория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргЛьготныеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Собственник</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проживаюший</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прописанный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РодственныеСвязи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргРодственныеСвязи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СолидарнаяОплата</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Льготы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПроцентЛьготы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛьготнаяКатегория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргЛьготныеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/энргКоличествоПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКоличествоПроживающих</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргКоличествоПрописанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКоличествоПрописанных</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргКоличествоСобственников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКоличествоСобственников</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргЗначенияЛьготныхКатегорий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргЗначенияЛьготныхКатегорий</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентОтНачислений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛьготнаяКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЛьготныеКатегории</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Documents/энргИзменениеКоличестваПрописанныхПроживающихСобственников/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ИзменяемыеПараметрыРасчета() Экспорт
	
	ИзменяемыеПараметрыРасчета 	= Новый Соответствие;
	ИзменяемыеПараметры 		= Новый Массив;	
	ИзменяемыеПараметры.Добавить(Новый Структура("Ресурсы","КоличествоПроживающих,КоличествоПрописанных,КоличествоСобственников"));	
	ИзменяемыеПараметрыРасчета.Вставить(Перечисления.энргВидыОпераций.ПустаяСсылка(), ИзменяемыеПараметры);
	
	ИзменяемыеПараметры 		= Новый Массив;	
	ИзменяемыеПараметры.Добавить(Новый Структура("Ресурсы,СвойстваСоставаЖильцов","СоставЖильцов","КоличествоПроживающих,КоличествоПрописанных,КоличествоСобственников"));	
	ИзменяемыеПараметрыРасчета.Вставить("НЕОПРЕДЕЛЕНО", ИзменяемыеПараметры);
	
	Возврат ИзменяемыеПараметрыРасчета;
	
КонецФункции

Процедура ПолучитьДанныеДляПроведенияПоСтабильнымПериодам(Схема,ВыбираемыеТаблицы) Экспорт	
	перем Пакет;
	
	ИмяТаблицы 											= "ДанныеДокументовИзменениеКоличестваПрописанныхПроживающихСобственников";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстДляПроведенияПоСтабильнымПериодам());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса()); 		
	КонецЦикла;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл				
		Если НЕ врПакет.ТаблицаДляПомещения = ИмяТаблицы Тогда
			ПакетУничтожение 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросУничтоженияТаблицыСхемыЗапроса"));
			ПакетУничтожение.ИмяТаблицы 				= врПакет.ТаблицаДляПомещения;
		КонецЕсли;				
	КонецЦикла; 
	 	
	ИмяТаблицы 											= "ДанныеДокументовИзменениеКоличестваПрописанныхПроживающихСобственниковСвязанныеПомещения";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстДляПроведенияПоСтабильнымПериодамСвязанныеПомещения());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса()); 		
	КонецЦикла;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл				
		Если НЕ врПакет.ТаблицаДляПомещения = ИмяТаблицы Тогда
			ПакетУничтожение 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросУничтоженияТаблицыСхемыЗапроса"));
			ПакетУничтожение.ИмяТаблицы 				= врПакет.ТаблицаДляПомещения;
		КонецЕсли;				
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
	ПараметрыЗапроса  			= Новый Структура;
	Схема 						= Неопределено;
	
	ДобавитьТекстЗапросаКоличествоПроживающих(Схема, Регистры);
	ДобавитьТекстЗапросаКоличествоПрописанных(Схема, Регистры);
	ДобавитьТекстЗапросаКоличествоСобственников(Схема, Регистры);
	ДобавитьТекстЗапросаЖильцыЛьготныхКатегорий(Схема, Регистры);
	ДобавитьТекстЗапросаСобственникиПомещений(Схема, Регистры);
	
	Если ДополнительныеСвойства.Свойство("ТаблицыПодмены") Тогда		
		ВспомогательныеПараметры 	= Новый Структура;
		энргФормированиеТекстовЗапроса.УстановитьПерехватОбращенияКТаблицам(Схема, ДополнительныеСвойства.ТаблицыПодмены, ВспомогательныеПараметры); 
	КонецЕсли;
	
	КлючиТаблицДвижений 			= энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	Запрос  						= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("мДокументы", 					ДокументСсылка);
	Запрос.УстановитьПараметр("ПустаяЛьгота", 					Справочники.энргЛьготныеКатегории.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", 	ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	
	Если ДополнительныеСвойства.Свойство("ТаблицыПодмены") Тогда		
		энргФормированиеТекстовЗапроса.УстановитьПараметрыТаблицыПодмены(Запрос, ВспомогательныеПараметры); 
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		Запрос.ВыполнитьПакет());
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

Процедура ИнициализироватьТаблицыДляКонтроля(ДокументСсылка,ДополнительныеСвойства) Экспорт 
	
	Схема  										= Неопределено;
	Параметры 									= Новый Структура;
	
	ДобавитьТекстЗапросаПараметрыКонтроля(Схема);
	ДобавитьТекстЗапросаКонтрольСостояниеМКД(Схема, Параметры);
		
	КлючиТаблицКонтроля  						= Новый Структура;
			
	Для Сч = 0 По Схема.ПакетЗапросов.Количество() - 1  Цикл
		Пакет 									= Схема.ПакетЗапросов[Сч];		
		Если Не ПустаяСтрока(Пакет.ТаблицаДляПомещения) И СтрНачинаетсяС(Пакет.ТаблицаДляПомещения, "Контроль") Тогда			
			КлючиТаблицКонтроля.Вставить(Прав(Пакет.ТаблицаДляПомещения,СтрДлина(Пакет.ТаблицаДляПомещения) - СтрДлина("Контроль")),Сч);			
			Пакет.ТаблицаДляПомещения 			= "";
		КонецЕсли;		
	КонецЦикла;
	ТекстСообщенияМногоквартирныйДомЗакрыт 		= НСтр("ru = 'На дату операции мкд закрыт'"); 
	ДанныеСтроения 								= ДополнительныеСвойства.ДанныеСтроения;
	
	Запрос  									= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("мДокументы", 								ДокументСсылка);
	Запрос.УстановитьПараметр("ЧастныйСектор",								ДанныеСтроения.ЧастныйСектор);
	Запрос.УстановитьПараметр("Строение", 									ДанныеСтроения.Строение);
	Запрос.УстановитьПараметр("ТекстСообщенияМногоквартирныйДомЗакрыт", 	ТекстСообщенияМногоквартирныйДомЗакрыт);
	
	ДополнительныеСвойства.Вставить("ТаблицыДляКонтроля", 					Запрос.ВыполнитьПакет());
	ДополнительныеСвойства.Вставить("КлючиТаблицКонтроля", 					КлючиТаблицКонтроля);
	
КонецПроцедуры

Процедура ЗаполнениеЖильцов(Объект) Экспорт
	
	Период = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргКоличествоПроживающихСрезПоследних.Организация КАК Организация,
		|	энргКоличествоПроживающихСрезПоследних.Район КАК Район,
		|	энргКоличествоПроживающихСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргКоличествоПроживающихСрезПоследних.Количество КАК КоличествоПроживающих,
		|	NULL КАК КоличествоПрописанных,
		|	NULL КАК КоличествоСобственников
		|ПОМЕСТИТЬ ВТ_Количество
		|ИЗ
		|	РегистрСведений.энргКоличествоПроживающих.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргКоличествоПроживающихСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	энргКоличествоПрописанныхСрезПоследних.Организация,
		|	энргКоличествоПрописанныхСрезПоследних.Район,
		|	энргКоличествоПрописанныхСрезПоследних.КлючПомещения,
		|	NULL,
		|	энргКоличествоПрописанныхСрезПоследних.Количество,
		|	NULL
		|ИЗ
		|	РегистрСведений.энргКоличествоПрописанных.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргКоличествоПрописанныхСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	энргКоличествоСобственниковСрезПоследних.Организация,
		|	энргКоличествоСобственниковСрезПоследних.Район,
		|	энргКоличествоСобственниковСрезПоследних.КлючПомещения,
		|	NULL,
		|	NULL,
		|	энргКоличествоСобственниковСрезПоследних.Количество
		|ИЗ
		|	РегистрСведений.энргКоличествоСобственников.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргКоличествоСобственниковСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргСобственникиПомещенийСрезПоследних.Организация КАК Организация,
		|	энргСобственникиПомещенийСрезПоследних.Район КАК Район,
		|	энргСобственникиПомещенийСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргСобственникиПомещенийСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
		|	энргСобственникиПомещенийСрезПоследних.ДолеваяСобственность КАК ДолеваяСобственность,
		|	энргСобственникиПомещенийСрезПоследних.ДоляСобственностиЧислитель КАК ДоляСобственностиЧислитель,
		|	энргСобственникиПомещенийСрезПоследних.ДоляСобственностиЗнаменатель КАК ДоляСобственностиЗнаменатель,
		|	энргСобственникиПомещенийСрезПоследних.СвидетельствоОРегистрацииНомер КАК СвидетельствоОРегистрацииНомер,
		|	энргСобственникиПомещенийСрезПоследних.СвидетельствоОРегистрацииДата КАК СвидетельствоОРегистрацииДата,
		|	энргСобственникиПомещенийСрезПоследних.СвидетельствоОРегистрацииСерия КАК СвидетельствоОРегистрацииСерия,
		|	энргСобственникиПомещенийСрезПоследних.СвидетельствоОРегистрацииКемВыдан КАК СвидетельствоОРегистрацииКемВыдан,
		|	энргСобственникиПомещенийСрезПоследних.Собственник КАК Собственник,
		|	энргСобственникиПомещенийСрезПоследних.Проживаюший КАК Проживаюший,
		|	энргСобственникиПомещенийСрезПоследних.Прописанный КАК Прописанный,
		|	энргСобственникиПомещенийСрезПоследних.РодственныеСвязи КАК РодственныеСвязи,
		|	&Абонент КАК Абонент
		|ПОМЕСТИТЬ ВТ_СобственикиПомещений
		|ИЗ
		|	РегистрСведений.энргСобственникиПомещений.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргСобственникиПомещенийСрезПоследних
		|ГДЕ
		|	энргСобственникиПомещенийСрезПоследних.Активна = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргЖильцыЛьготныхКатегорийСрезПоследних.Жилец КАК Жилец,
		|	энргЖильцыЛьготныхКатегорийСрезПоследних.Организация КАК Организация,
		|	энргЖильцыЛьготныхКатегорийСрезПоследних.Район КАК Район,
		|	энргЖильцыЛьготныхКатегорийСрезПоследних.ЛьготнаяКатегория КАК ЛьготнаяКатегория,
		|	энргЖильцыЛьготныхКатегорийСрезПоследних.Период КАК Период
		|ПОМЕСТИТЬ ВТ_ЛьготыЖильца
		|ИЗ
		|	РегистрСведений.энргЖильцыЛьготныхКатегорий.СрезПоследних(
		|			&Период,
		|			(Жилец, Организация, Район) В
		|					(ВЫБРАТЬ
		|						ВТ_СобственикиПомещений.ФизическоеЛицо КАК ФизическоеЛицо,
		|						ВТ_СобственикиПомещений.Организация КАК Организация,
		|						ВТ_СобственикиПомещений.Район КАК Район
		|					ИЗ
		|						ВТ_СобственикиПомещений КАК ВТ_СобственикиПомещений)
		|				И Абонент = &Абонент) КАК энргЖильцыЛьготныхКатегорийСрезПоследних
		|ГДЕ
		|	энргЖильцыЛьготныхКатегорийСрезПоследних.Состояние
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЛьготыЖильца.Жилец КАК Жилец,
		|	ВТ_ЛьготыЖильца.Организация КАК Организация,
		|	ВТ_ЛьготыЖильца.Район КАК Район,
		|	МАКСИМУМ(ВТ_ЛьготыЖильца.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_ДатаПоследнейЛьготы
		|ИЗ
		|	ВТ_ЛьготыЖильца КАК ВТ_ЛьготыЖильца
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЛьготыЖильца.Жилец,
		|	ВТ_ЛьготыЖильца.Организация,
		|	ВТ_ЛьготыЖильца.Район
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЛьготыЖильца.Жилец КАК Жилец,
		|	ВТ_ЛьготыЖильца.Организация КАК Организация,
		|	ВТ_ЛьготыЖильца.Район КАК Район,
		|	ВТ_ЛьготыЖильца.ЛьготнаяКатегория КАК ЛьготнаяКатегория
		|ПОМЕСТИТЬ ВТ_ПоследняяЛьгота
		|ИЗ
		|	ВТ_ЛьготыЖильца КАК ВТ_ЛьготыЖильца
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДатаПоследнейЛьготы КАК ВТ_ДатаПоследнейЛьготы
		|		ПО ВТ_ЛьготыЖильца.Жилец = ВТ_ДатаПоследнейЛьготы.Жилец
		|			И ВТ_ЛьготыЖильца.Организация = ВТ_ДатаПоследнейЛьготы.Организация
		|			И ВТ_ЛьготыЖильца.Район = ВТ_ДатаПоследнейЛьготы.Район
		|			И ВТ_ЛьготыЖильца.Период = ВТ_ДатаПоследнейЛьготы.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргЗначенияЛьготныхКатегорийСрезПоследних.Организация КАК Организация,
		|	энргЗначенияЛьготныхКатегорийСрезПоследних.Район КАК Район,
		|	энргЗначенияЛьготныхКатегорийСрезПоследних.ЛьготнаяКатегория КАК ЛьготнаяКатегория,
		|	энргЗначенияЛьготныхКатегорийСрезПоследних.ПроцентОтНачислений КАК ПроцентОтНачислений
		|ПОМЕСТИТЬ ВТ_ПроцентЛьготы
		|ИЗ
		|	РегистрСведений.энргЗначенияЛьготныхКатегорий.СрезПоследних(
		|			&Период,
		|			(Организация, Район, ЛьготнаяКатегория) В
		|				(ВЫБРАТЬ
		|					ВТ_ПоследняяЛьгота.Организация КАК Организация,
		|					ВТ_ПоследняяЛьгота.Район КАК Район,
		|					ВТ_ПоследняяЛьгота.ЛьготнаяКатегория КАК ЛьготнаяКатегория
		|				ИЗ
		|					ВТ_ПоследняяЛьгота КАК ВТ_ПоследняяЛьгота)) КАК энргЗначенияЛьготныхКатегорийСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СобственикиПомещений.КлючПомещения КАК КлючПомещения,
		|	МАКСИМУМ(ВТ_СобственикиПомещений.ДолеваяСобственность) КАК ДолеваяСобственность
		|ИЗ
		|	ВТ_СобственикиПомещений КАК ВТ_СобственикиПомещений
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СобственикиПомещений.КлючПомещения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Количество.КлючПомещения КАК КлючПомещения,
		|	МАКСИМУМ(ВТ_Количество.КоличествоПроживающих) КАК КоличествоПроживающих,
		|	МАКСИМУМ(ВТ_Количество.КоличествоПрописанных) КАК КоличествоПрописанных,
		|	МАКСИМУМ(ВТ_Количество.КоличествоСобственников) КАК КоличествоСобственников
		|ИЗ
		|	ВТ_Количество КАК ВТ_Количество
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Количество.КлючПомещения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СобственикиПомещений.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТ_СобственикиПомещений.ДоляСобственностиЧислитель КАК ДоляСобственностиЧислитель,
		|	ВТ_СобственикиПомещений.ДоляСобственностиЗнаменатель КАК ДоляСобственностиЗнаменатель,
		|	ВТ_СобственикиПомещений.СвидетельствоОРегистрацииНомер КАК СвидетельствоОРегистрацииНомер,
		|	ВТ_СобственикиПомещений.СвидетельствоОРегистрацииДата КАК СвидетельствоОРегистрацииДата,
		|	ВТ_СобственикиПомещений.СвидетельствоОРегистрацииСерия КАК СвидетельствоОРегистрацииСерия,
		|	ВТ_СобственикиПомещений.СвидетельствоОРегистрацииКемВыдан КАК СвидетельствоОРегистрацииКемВыдан,
		|	ВТ_СобственикиПомещений.Собственник КАК Собственник,
		|	ВТ_СобственикиПомещений.Проживаюший КАК Проживаюший,
		|	ВТ_СобственикиПомещений.Прописанный КАК Прописанный,
		|	ВТ_СобственикиПомещений.РодственныеСвязи КАК РодственныеСвязи,
		|	ВТ_СобственикиПомещений.Абонент КАК Абонент,
		|	ВТ_ПоследняяЛьгота.ЛьготнаяКатегория КАК ЛьготнаяКатегория,
		|	ВТ_ПроцентЛьготы.ПроцентОтНачислений КАК ПроцентЛьготы
		|ИЗ
		|	ВТ_СобственикиПомещений КАК ВТ_СобственикиПомещений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоследняяЛьгота КАК ВТ_ПоследняяЛьгота
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПроцентЛьготы КАК ВТ_ПроцентЛьготы
		|			ПО ВТ_ПоследняяЛьгота.Организация = ВТ_ПроцентЛьготы.Организация
		|				И ВТ_ПоследняяЛьгота.Район = ВТ_ПроцентЛьготы.Район
		|				И ВТ_ПоследняяЛьгота.ЛьготнаяКатегория = ВТ_ПроцентЛьготы.ЛьготнаяКатегория
		|		ПО ВТ_СобственикиПомещений.Организация = ВТ_ПоследняяЛьгота.Организация
		|			И ВТ_СобственикиПомещений.Район = ВТ_ПоследняяЛьгота.Район
		|			И ВТ_СобственикиПомещений.ФизическоеЛицо = ВТ_ПоследняяЛьгота.Жилец";
	
	Запрос.УстановитьПараметр("Абонент", 		Объект.Абонент);
	Запрос.УстановитьПараметр("КлючПомещения", 	Объект.КлючПомещения);
	Запрос.УстановитьПараметр("Организация", 	Объект.Организация);
	Запрос.УстановитьПараметр("Период", 		Период);
	Запрос.УстановитьПараметр("Район", 			Объект.Район);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	КолЗапросов		 = РезультатЗапроса.Количество();
	
	ВыборкаДолеваяСоб = РезультатЗапроса[КолЗапросов-3].Выбрать();
	Объект.ДолеваяСобственность = ?(ВыборкаДолеваяСоб.Следующий(), ВыборкаДолеваяСоб.ДолеваяСобственность, Ложь);

	ДанныеКол		 = Новый Структура("КоличествоПроживающих, КоличествоСобственников, КоличествоПрописанных", 0, 0, 0);
	ВыборкаКол = РезультатЗапроса[КолЗапросов-2].Выбрать();
	Если ВыборкаКол.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеКол, ВыборкаКол);
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(Объект, ДанныеКол);
	
	ВыборкаЛьготыЖильцов = РезультатЗапроса[КолЗапросов-1].Выбрать();
	ТекФЛ = Неопределено;
	ТекIDСтроки = Неопределено;
	
	ДанныеЖильцы		 = Новый Структура("ФизическоеЛицо, ДоляСобственностиЧислитель, ДоляСобственностиЗнаменатель, СвидетельствоОРегистрацииНомер,СвидетельствоОРегистрацииДата, СвидетельствоОРегистрацииСерия,СвидетельствоОРегистрацииКемВыдан,Собственник, Проживающий, Прописанный,РодственныеСвязи, Абонент, IDСтроки");
	ДанныеЛьготы		 = Новый Структура("ФизическоеЛицо, Абонент, ЛьготнаяКатегория, ПроцентЛьготы, IDСтроки");
	
	Пока ВыборкаЛьготыЖильцов.Следующий() Цикл 
		
		Если ТекФЛ = Неопределено Или не ТекФЛ = ВыборкаЛьготыЖильцов.ФизическоеЛицо Тогда 
			ТекФЛ = ВыборкаЛьготыЖильцов.ФизическоеЛицо;
			ТекIDСтроки = Новый УникальныйИдентификатор;
			
			ЗаполнитьЗначенияСвойств(ДанныеЖильцы, ВыборкаЛьготыЖильцов);
			ДанныеЖильцы.IDСтроки = текIDСтроки;
			ЗаполнитьЗначенияСвойств(ДанныеЛьготы, ВыборкаЛьготыЖильцов);
			ДанныеЛьготы.IDСтроки = текIDСтроки;
			ЗаполнитьЗначенияСвойств(Объект.Жильцы.Добавить(), ДанныеЖильцы);
			ЗаполнитьЗначенияСвойств(Объект.Льготы.Добавить(), ДанныеЛьготы);
			
		Иначе 
			ЗаполнитьЗначенияСвойств(ДанныеЛьготы, ВыборкаЛьготыЖильцов);
			ДанныеЛьготы.IDСтроки = текIDСтроки;
			ЗаполнитьЗначенияСвойств(Объект.Льготы.Добавить(), ДанныеЛьготы);

		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РеализацияИнтерефейса_Проведение

Процедура ДобавитьТекстЗапросаКоличествоПроживающих(Схема, Регистры)
	
	ИмяРегистра = "энргКоличествоПроживающих";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА НЕ энргИзменениеКоличестваПрописанныхПроживающихСобственников.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА энргИзменениеКоличестваПрописанныхПроживающихСобственников.ДатаФактическогоСобытия
		|		ИНАЧЕ энргИзменениеКоличестваПрописанныхПроживающихСобственников.Дата
		|	КОНЕЦ КАК Период,
		|	энргИзменениеКоличестваПрописанныхПроживающихСобственников.Организация КАК Организация,
		|	энргИзменениеКоличестваПрописанныхПроживающихСобственников.Район КАК Район,
		|	энргИзменениеКоличестваПрописанныхПроживающихСобственников.КлючПомещения КАК КлючПомещения,
		|	энргИзменениеКоличестваПрописанныхПроживающихСобственников.КоличествоПроживающих КАК Количество,
		|	энргИзменениеКоличестваПрописанныхПроживающихСобственников.Дата КАК ПериодРегистрации,
		|	НАЧАЛОПЕРИОДА(энргИзменениеКоличестваПрописанныхПроживающихСобственников.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
		|ИЗ
		|	Документ.энргИзменениеКоличестваПрописанныхПроживающихСобственников КАК энргИзменениеКоличестваПрописанныхПроживающихСобственников
		|ГДЕ
		|	энргИзменениеКоличестваПрописанныхПроживающихСобственников.Ссылка В(&мДокументы)";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаКоличествоПрописанных(Схема, Регистры)
	
	ИмяРегистра = "энргКоличествоПрописанных";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА НЕ энргИзменениеКоличестваПрописанныхПроживающихСобственников.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА энргИзменениеКоличестваПрописанныхПроживающихСобственников.ДатаФактическогоСобытия
		|		ИНАЧЕ энргИзменениеКоличестваПрописанныхПроживающихСобственников.Дата
		|	КОНЕЦ КАК Период,
		|	энргИзменениеКоличестваПрописанныхПроживающихСобственников.Организация КАК Организация,
		|	энргИзменениеКоличестваПрописанныхПроживающихСобственников.Район КАК Район,
		|	энргИзменениеКоличестваПрописанныхПроживающихСобственников.КлючПомещения КАК КлючПомещения,
		|	энргИзменениеКоличестваПрописанныхПроживающихСобственников.КоличествоПрописанных КАК Количество,
		|	энргИзменениеКоличестваПрописанныхПроживающихСобственников.Дата КАК ПериодРегистрации,
		|	НАЧАЛОПЕРИОДА(энргИзменениеКоличестваПрописанныхПроживающихСобственников.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
		|ИЗ
		|	Документ.энргИзменениеКоличестваПрописанныхПроживающихСобственников КАК энргИзменениеКоличестваПрописанныхПроживающихСобственников
		|ГДЕ
		|	энргИзменениеКоличестваПрописанныхПроживающихСобственников.Ссылка В(&мДокументы)"; 	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаКоличествоСобственников(Схема, Регистры)
	
	ИмяРегистра = "энргКоличествоСобственников";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА НЕ энргИзменениеКоличестваПрописанныхПроживающихСобственников.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА энргИзменениеКоличестваПрописанныхПроживающихСобственников.ДатаФактическогоСобытия
		|		ИНАЧЕ энргИзменениеКоличестваПрописанныхПроживающихСобственников.Дата
		|	КОНЕЦ КАК Период,
		|	энргИзменениеКоличестваПрописанныхПроживающихСобственников.Организация КАК Организация,
		|	энргИзменениеКоличестваПрописанныхПроживающихСобственников.Район КАК Район,
		|	энргИзменениеКоличестваПрописанныхПроживающихСобственников.КлючПомещения КАК КлючПомещения,
		|	энргИзменениеКоличестваПрописанныхПроживающихСобственников.КоличествоСобственников КАК Количество,
		|	энргИзменениеКоличестваПрописанныхПроживающихСобственников.Дата КАК ПериодРегистрации,
		|	НАЧАЛОПЕРИОДА(энргИзменениеКоличестваПрописанныхПроживающихСобственников.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
		|ИЗ
		|	Документ.энргИзменениеКоличестваПрописанныхПроживающихСобственников КАК энргИзменениеКоличестваПрописанныхПроживающихСобственников
		|ГДЕ
		|	энргИзменениеКоличестваПрописанныхПроживающихСобственников.Ссылка В(&мДокументы)";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаЖильцыЛьготныхКатегорий(Схема, Регистры)
	
	ИмяРегистра = "энргЖильцыЛьготныхКатегорий";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА НЕ энргИзменениеКоличестваПрописанныхПроживающихСобственников.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА энргИзменениеКоличестваПрописанныхПроживающихСобственников.ДатаФактическогоСобытия
		|		ИНАЧЕ энргИзменениеКоличестваПрописанныхПроживающихСобственников.Дата
		|	КОНЕЦ КАК Период,
		|	энргИзменениеКоличестваПрописанныхПроживающихСобственниковЖильцы.ФизическоеЛицо КАК Жилец,
		|	энргИзменениеКоличестваПрописанныхПроживающихСобственников.Организация КАК Организация,
		|	энргИзменениеКоличестваПрописанныхПроживающихСобственников.Район КАК Район,
		|	энргИзменениеКоличестваПрописанныхПроживающихСобственников.Абонент КАК Абонент,
		|	энргИзменениеКоличестваПрописанныхПроживающихСобственников.Дата КАК ПериодРегистрации,
		|	НАЧАЛОПЕРИОДА(энргИзменениеКоличестваПрописанныхПроживающихСобственников.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
		|	ИСТИНА КАК Состояние,
		|	энргИзменениеКоличестваПрописанныхПроживающихСобственниковЛьготы.ПроцентЛьготы КАК ПроцентЛьготы,
		|	энргИзменениеКоличестваПрописанныхПроживающихСобственниковЛьготы.ЛьготнаяКатегория КАК ЛьготнаяКатегория
		|ИЗ
		|	Документ.энргИзменениеКоличестваПрописанныхПроживающихСобственников КАК энргИзменениеКоличестваПрописанныхПроживающихСобственников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргИзменениеКоличестваПрописанныхПроживающихСобственников.Жильцы КАК энргИзменениеКоличестваПрописанныхПроживающихСобственниковЖильцы
		|		ПО энргИзменениеКоличестваПрописанныхПроживающихСобственников.Ссылка = энргИзменениеКоличестваПрописанныхПроживающихСобственниковЖильцы.Ссылка
		|			И (энргИзменениеКоличестваПрописанныхПроживающихСобственников.Ссылка В (&мДокументы))
		|			И (энргИзменениеКоличестваПрописанныхПроживающихСобственниковЖильцы.Ссылка В (&мДокументы))
		|			И (энргИзменениеКоличестваПрописанныхПроживающихСобственниковЖильцы.ФизическоеЛицо ССЫЛКА Справочник.энргКонтрагенты)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргИзменениеКоличестваПрописанныхПроживающихСобственников.Льготы КАК энргИзменениеКоличестваПрописанныхПроживающихСобственниковЛьготы
		|		ПО (энргИзменениеКоличестваПрописанныхПроживающихСобственниковЖильцы.IDСтроки = энргИзменениеКоличестваПрописанныхПроживающихСобственниковЛьготы.IDСтроки)
		|			И (энргИзменениеКоличестваПрописанныхПроживающихСобственниковЛьготы.ЛьготнаяКатегория <> ЗНАЧЕНИЕ(Справочник.энргЛьготныеКатегории.ПустаяСсылка))
		|ГДЕ
		|	НЕ энргИзменениеКоличестваПрописанныхПроживающихСобственниковЛьготы.ЛьготнаяКатегория = &ПустаяЛьгота";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаСобственникиПомещений(Схема, Регистры)
	
	ИмяРегистра = "энргСобственникиПомещений";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст 		= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	табЖильцы.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ИСТИНА КАК Активна,
	|	Шапка.ДолеваяСобственность КАК ДолеваяСобственность,
	|	ВЫБОР
	|		КОГДА Шапка.ДолеваяСобственность
	|			ТОГДА табЖильцы.ДоляСобственностиЧислитель
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДоляСобственностиЧислитель,
	|	ВЫБОР
	|		КОГДА Шапка.ДолеваяСобственность
	|			ТОГДА табЖильцы.ДоляСобственностиЗнаменатель
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДоляСобственностиЗнаменатель,
	|	табЖильцы.СвидетельствоОРегистрацииНомер КАК СвидетельствоОРегистрацииНомер,
	|	табЖильцы.СвидетельствоОРегистрацииДата КАК СвидетельствоОРегистрацииДата,
	|	табЖильцы.СвидетельствоОРегистрацииСерия КАК СвидетельствоОРегистрацииСерия,
	|	табЖильцы.СвидетельствоОРегистрацииКемВыдан КАК СвидетельствоОРегистрацииКемВыдан,
	|	табЖильцы.Собственник КАК Собственник,
	|	табЖильцы.Проживаюший КАК Проживаюший,
	|	табЖильцы.Прописанный КАК Прописанный,
	|	табЖильцы.РодственныеСвязи КАК РодственныеСвязи,
	|	табЖильцы.СолидарнаяОплата КАК СолидарнаяОплата
	|ИЗ
	|	Документ.энргИзменениеКоличестваПрописанныхПроживающихСобственников КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргИзменениеКоличестваПрописанныхПроживающихСобственников.Жильцы КАК табЖильцы
	|		ПО Шапка.Ссылка = табЖильцы.Ссылка
	|ГДЕ
	|	Шапка.Ссылка В(&мДокументы)
	|	И табЖильцы.Ссылка В(&мДокументы)";
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;  	
		
КонецПроцедуры

#КонецОбласти

#Область РеализацияИнтрейфеса_КонтрольПроведения

Процедура ДобавитьТекстЗапросаКонтрольСостояниеМКД(Схема, Параметры)
	
	ПараметрыСостоянияМКД 		= Новый Структура;
	ПараметрыВременнойТаблицы 	= Новый Массив;
	ПараметрыВременнойТаблицы.Добавить(Новый Структура("ИмяПараметра, ТаблицаИсточник, ТипПараметра, СоотвествиеПолей","ПараметрыКонтроля","ПараметрыКонтроля","ТипПараметраВременнаяТаблица", Новый Структура("Организация,Район,МКД","Организация","Район","МКД")));
	ПараметрыСостоянияМКД.Вставить("ПараметрыВТ", ПараметрыВременнойТаблицы);
	РегистрыСведений.энргСостояниеМКД.СостояниеМногоквартирногоДома(Схема,ПараметрыСостоянияМКД,"СостояниеМногоквартирногоДома");
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст 			=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПРЕДСТАВЛЕНИЕ(ПараметрыКонтроля.Ссылка) КАК ПредставлениеОбъекта,
	|	&ТекстСообщенияМногоквартирныйДомЗакрыт КАК ТекстСообщения
	|ИЗ
	|	ПараметрыКонтроля КАК ПараметрыКонтроля
	|		ЛЕВОЕ СОЕДИНЕНИЕ СостояниеМногоквартирногоДома КАК СостояниеМногоквартирногоДома
	|		ПО ПараметрыКонтроля.Организация = СостояниеМногоквартирногоДома.Организация
	|			И ПараметрыКонтроля.Район = СостояниеМногоквартирногоДома.Район
	|			И ПараметрыКонтроля.МКД = СостояниеМногоквартирногоДома.МКД
	|ГДЕ
	|	НЕ ПараметрыКонтроля.ЧастныйСектор
	|	И (НЕ ЕСТЬNULL(СостояниеМногоквартирногоДома.Состояние, ЛОЖЬ)
	|			ИЛИ КОНЕЦПЕРИОДА(ПараметрыКонтроля.Период, ДЕНЬ) < ЕСТЬNULL(КОНЕЦПЕРИОДА(СостояниеМногоквартирногоДома.Период, ДЕНЬ), ДАТАВРЕМЯ(1, 1, 1)))";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения 			= "КонтрольСостояниеМКД";
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПараметрыКонтроля(Схема)
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст 		=
		"ВЫБРАТЬ
		|	энргИзменениеКоличестваПрописанныхПроживающихСобственников.Ссылка КАК Ссылка,
		|	энргИзменениеКоличестваПрописанныхПроживающихСобственников.Организация КАК Организация,
		|	энргИзменениеКоличестваПрописанныхПроживающихСобственников.Район КАК Район,
		|	&ЧастныйСектор КАК ЧастныйСектор,
		|	ВЫБОР
		|		КОГДА &ЧастныйСектор
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.пустаяСсылка)
		|		ИНАЧЕ &Строение
		|	КОНЕЦ КАК МКД,
		|	ВЫБОР
		|		КОГДА НЕ энргИзменениеКоличестваПрописанныхПроживающихСобственников.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА энргИзменениеКоличестваПрописанныхПроживающихСобственников.ДатаФактическогоСобытия
		|		ИНАЧЕ энргИзменениеКоличестваПрописанныхПроживающихСобственников.Дата
		|	КОНЕЦ КАК Период
		|ПОМЕСТИТЬ ПараметрыКонтроля
		|ИЗ
		|	Документ.энргИзменениеКоличестваПрописанныхПроживающихСобственников КАК энргИзменениеКоличестваПрописанныхПроживающихСобственников
		|ГДЕ
		|	энргИзменениеКоличестваПрописанныхПроживающихСобственников.Ссылка В(&мДокументы)";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	
КонецПроцедуры

#КонецОбласти

#Область РеализацияИнтерфейса_РаботаСоСтабильнымиПериодыми

Функция ТекстДляПроведенияПоСтабильнымПериодам()
	
	Текст 		=
	"ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация КАК Организация,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|	ДокументыДляПроведения.Строение КАК Строение,
	|	ДокументыДляПроведения.Помещение КАК Помещение,
	|	ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|	Шапка.Дата КАК ДатаРегистратора,
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|	Шапка.КоличествоПроживающих КАК КоличествоПроживающих,
	|	Шапка.КоличествоСобственников КАК КоличествоСобственников,
	|	Шапка.КоличествоПрописанных КАК КоличествоПрописанных
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргИзменениеКоличестваПрописанныхПроживающихСобственников КАК Шапка
	|		ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка
	|			И ДокументыДляПроведения.КлючПомещения = Шапка.КлючПомещения";
	
	Возврат Текст;

КонецФункции

Функция ТекстДляПроведенияПоСтабильнымПериодамСвязанныеПомещения() 
	Текст 		=
	"ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация КАК Организация,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|	ДокументыДляПроведения.Строение КАК Строение,
	|	ДокументыДляПроведения.Помещение КАК Помещение,
	|	ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|	Шапка.Дата КАК ДатаРегистратора,
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|	Шапка.КоличествоПроживающих КАК КоличествоПроживающих,
	|	Шапка.КоличествоСобственников КАК КоличествоСобственников,
	|	Шапка.КоличествоПрописанных КАК КоличествоПрописанных,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	""НЕОПРЕДЕЛЕНО"" КАК ВидОперации
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргИзменениеКоличестваПрописанныхПроживающихСобственников КАК Шапка
	|		ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка
	|			И (НЕ ДокументыДляПроведения.КлючПомещения = Шапка.КлючПомещения)";
	
	Возврат Текст;

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
